package messages

// 2|1668096007349|{"e":"depthUpdate","E":1668096007280,"T":1668096007269,"s":"ETCUSDT","U":2140459488301,"u":2140459497646,"pu":2140459487586,"b":[["22.353","16.16"],["22.352","18.00"],["22.350","19.17"],["22.346","99.39"],["22.345","100.61"],["22.344","310.31"],["22.343","117.14"],["22.342","42.13"],["22.341","121.34"],["22.340","69.44"],["22.339","217.60"],["22.338","291.21"],["22.335","0.39"],["22.334","11.43"],["22.333","93.58"],["22.332","314.30"],["22.330","65.21"],["22.329","110.85"],["22.328","32.95"],["22.327","175.20"]],"a":[["22.357","2.32"],["22.360","2.91"],["22.361","10.14"],["22.362","1.28"],["22.363","22.07"],["22.364","7.18"],["22.365","10.00"],["22.366","55.32"],["22.367","370.82"],["22.368","326.59"],["22.369","45.34"],["22.370","156.60"],["22.371","19.89"],["22.372","227.54"],["22.373","123.38"],["22.374","313.28"],["22.375","102.54"],["22.376","6.54"],["22.377","11.77"],["22.378","69.95"]]}
// {
// 	"e": "depthUpdate",           // 事件类型
// 	"E": 1571889248277,           // 事件时间
// 	"T": 1571889248276,           // 交易时间
// 	"s": "BTCUSDT",
// 	"U": 390497796,
// 	"u": 390497878,
// 	"pu": 390497794,
// 	"b": [                        // 买方
// 	  [
// 		"7403.89",                // 价格
// 		"0.002"                   // 数量
// 	  ],
// 	  [
// 		"7403.90",
// 		"3.906"
// 	  ],
// 	  [
// 		"7404.00",
// 		"1.428"
// 	  ],
// 	  [
// 		"7404.85",
// 		"5.239"
// 	  ],
// 	  [
// 		"7405.43",
// 		"2.562"
// 	  ]
// 	],
// 	"a": [                        // 卖方
// 	  [
// 		"7405.96",                // 价格
// 		"3.340"                   // 数量
// 	  ],
// 	  [
// 		"7406.63",
// 		"4.525"
// 	  ],
// 	  [
// 		"7407.08",
// 		"2.475"
// 	  ],
// 	  [
// 		"7407.15",
// 		"4.800"
// 	  ],
// 	  [
// 		"7407.20",
// 		"0.175"
// 	  ]
// 	]
//   }

// "e": "depthUpdate",           // 事件类型
// 	"E": 1571889248277,           // 事件时间
// 	"T": 1571889248276,           // 交易时间
// 	"s": "BTCUSDT",
// "U": 157,             // 从上次推送至今新增的第一个 update Id
//   "u": 160,             // 从上次推送至今新增的最后一个 update Id
//   "pu": 149,            // 上次推送的最后一个update Id(即上条消息的‘u’)

type BinanceOrderResponse struct {
	EventKind   string `json:"e"`
	EventTime   int64  `json:"E"`
	TradingTime int64  `json:"T"`
	Symbol      string `json:"s"`
	FirstID     int64  `json:"U"`
	LastID      int64  `json:"u"`
	PrepLastID  int64  `json:"pu"`

	Bids [20]([2]string) `json:"b"`
	Asks [20]([2]string) `json:"a"`
}

// 2|1668096000000|{"e":"aggTrade","E":1668095999972,"a":300049561,"s":"SOLUSDT","p":"17.4950","q":"27","f":610097120,"l":610097121,"T":1668095999964,"m":true}
// {
// 	"e": "aggTrade",  // 事件类型
// 	"E": 123456789,   // 事件时间
// 	"s": "BNBUSDT",    // 交易对
// 	"a": 5933014,     // 归集成交 ID
// 	"p": "0.001",     // 成交价格
// 	"q": "100",       // 成交量
// 	"f": 100,         // 被归集的首个交易ID
// 	"l": 105,         // 被归集的末次交易ID
// 	"T": 123456785,   // 成交时间
// 	"m": true         // 买方是否是做市方。如true，则此次成交是一个主动卖出单，否则是一个主动买入单。
//   }
type BinanceTradeResponse struct {
	EventKind   string `json:"e"`
	EventTime   int64  `json:"E"`
	Symbol      string `json:"s"`
	AggID       int64  `json:"a"`
	Price       string `json:"p"`
	Size        string `json:"q"`
	FirstID     int64  `json:"f"`
	LastID      int64  `json:"l"`
	TradingTime int64  `json:"T"`
	IsMaker     bool   `json:"m"`
}

// type OkexOrderContents struct {
// 	Asks       [][4]string `json:"asks"`
// 	Bids       [][4]string `json:"bids"`
// 	ExchangeTm string      `json:"ts"`
// 	CheckSum   int32       `json:"checksum"`
// }

// type OkexOrderResponse struct {
// 	Arg    OkexSubMsg_         `json:"arg"`
// 	Action string              `json:"action"`
// 	Data   []OkexOrderContents `json:"data"`
// }
